# Welcome to Jupyter!

This repo contains an introduction to [Jupyter](https://jupyter.org) and [IPython](https://ipython.org).

Outline of some basics:

* [Notebook Basics](../examples/Notebook/Notebook%20Basics.ipynb)
* [IPython - beyond plain python](../examples/IPython%20Kernel/Beyond%20Plain%20Python.ipynb)
* [Markdown Cells](../examples/Notebook/Working%20With%20Markdown%20Cells.ipynb)
* [Rich Display System](../examples/IPython%20Kernel/Rich%20Output.ipynb)
* [Custom Display logic](../examples/IPython%20Kernel/Custom%20Display%20Logic.ipynb)
* [Running a Secure Public Notebook Server](../examples/Notebook/Running%20the%20Notebook%20Server.ipynb#Securing-the-notebook-server)
* [How Jupyter works](../examples/Notebook/Multiple%20Languages%2C%20Frontends.ipynb) to run code in different languages.

You can also get this tutorial and run it on your laptop:

    git clone https://github.com/ipython/ipython-in-depth

Install IPython and Jupyter:

with [conda](https://www.anaconda.com/download):

    conda install ipython jupyter

with pip:

    # first, always upgrade pip!
    pip install --upgrade pip
    pip install --upgrade ipython jupyter

Start the notebook in the tutorial directory:

    cd ipython-in-depth
    jupyter notebook

In [141]:
def sum(x,y):
    z=x+y
    return z

sum(2,3)

5

In [142]:
import pandas as pd

In [143]:
#making df from dictionary
df=pd.DataFrame({"Name":["shailendra","Mukesh","Manni"],"age":[32,34,14]})

In [144]:
df

         Name  age
0  shailendra   32
1      Mukesh   34
2       Manni   14

In [145]:
df["age"]=df["age"].apply(lambda x:x+4)

In [146]:
df

         Name  age
0  shailendra   36
1      Mukesh   38
2       Manni   18

In [147]:
df["shape"]=df["Name"].map({"shailendra":"Fat","Mukesh":"Slim","Manni":"Fit"})

In [148]:
df

         Name  age shape
0  shailendra   36   Fat
1      Mukesh   38  Slim
2       Manni   18   Fit

In [149]:
df.iloc[1:2]

     Name  age shape
1  Mukesh   38  Slim

In [150]:
df.loc[1:2]

     Name  age shape
1  Mukesh   38  Slim
2   Manni   18   Fit

In [151]:
df

         Name  age shape
0  shailendra   36   Fat
1      Mukesh   38  Slim
2       Manni   18   Fit

In [152]:
#find the fat person in the df
df.loc[df["shape"]=="Fat"]

         Name  age shape
0  shailendra   36   Fat

In [153]:
#find person who is fat and who is of age >15
df.loc[(df["shape"]=="Fat")|(df["age"]>15)]

         Name  age shape
0  shailendra   36   Fat
1      Mukesh   38  Slim
2       Manni   18   Fit

In [154]:
#find a person with age 18 and is Fit
df.loc[(df["age"]==18)&(df["Name"]=="Manni")]

    Name  age shape
2  Manni   18   Fit

In [155]:
df["occupation"]=pd.Series(["Doctor","Manager","Student"])

In [156]:
df

         Name  age shape occupation
0  shailendra   36   Fat     Doctor
1      Mukesh   38  Slim    Manager
2       Manni   18   Fit    Student

In [171]:
#find the student and show his age
#select            #where
df[["age","Name"]][(df["occupation"]=="Student")]

   age   Name
2   18  Manni

In [172]:
#similar example
#select all occupations with age greater than 18
df["occupation"][(df["age"]>18)]

0     Doctor
1    Manager
Name: occupation, dtype: object